import os
from flask import Flask
from threading import Thread

import asyncio
import logging
import random
import datetime
import json
from aiogram import Bot, Dispatcher, types
from aiogram.types import ReplyKeyboardMarkup, KeyboardButton, InlineKeyboardMarkup, InlineKeyboardButton, FSInputFile
from aiogram.filters import Command
from aiogram import Router
from aiogram.fsm.storage.memory import MemoryStorage

app = Flask('')

@app.route('/')
def home():
    return "I'm alive"

def run():
    app.run(host='0.0.0.0', port=8080)

def keep_alive():
    t = Thread(target=run)
    t.start()

# Initialize bot and dispatcher
BOT_TOKEN = os.getenv('BOT_TOKEN')
ADMIN_ID = int(os.getenv('ADMIN_ID'))
bot = Bot(token=BOT_TOKEN)
storage = MemoryStorage()
dp = Dispatcher(storage=storage)
router = Router()
# Инициализация логгера для aiogram
logging.basicConfig(level=logging.INFO)
# Словарь для хранения информации о последнем использовании команды прогноза на день
user_last_daily_forecast = {}
# Файл для хранения ID пользователей
USERS_FILE = 'users.json'

# Функции для работы с файлом пользователей
def load_user_ids():
    if os.path.exists(USERS_FILE):
        with open(USERS_FILE, 'r') as f:
            return json.load(f)
    return []

def save_user_ids(user_ids):
    with open(USERS_FILE, 'w') as f:
        json.dump(user_ids, f)

# Словарь с путями к gif-файлам и их описаниями
gif_data = {
    'data/cards/00.gif': "Сьогодні ви повинні бути відкриті всьому новому.Сприймайте все якомога неупереджено, не приймайте нічого близько до серця і ставтеся навіть до речей малоприємним з однією лише цікавістю. доведеться переконатися, що якусь справу доведеться починати заново, з самого нуля, то не впадайте у відчай, а навпаки, з радістю беріться за нове починання. Сьогодні ви можете дозволити собі трошки побути божевільним!",
    'data/cards/01.gif': "«Ніхто, крім тебе, і ніколи більше, окрім прямо зараз»!— каже ваше гасло сьогодення.Візьміть ініціативу у свої руки.Ви маєте відмінний здоровий глузд, ви знаєте, чого хочете, і у вас вистачить терпіння довести задуману справу до кінця.Якщо від вас потрібно буде прийняти рішення, зробити перший крок, виявити свої здібності та досвід у всій їхній повноті, знайте — сьогодні найбільш вдалий для цього день.Покажіть, на що ви здатні, дійте вільно та сміливо у всіх переговорах та зустрічах, і тоді всі партнери будуть на вашому боці, підтримають та допоможуть.",
    'data/cards/02.gif': "Прийміть цей день як щось належне і це, будьте спокійні і просто спостерігайте, що відбувається, не чекаючи чогось певного.Дайте всьому йти своєю чергою, втручаючись лише коли цього вимагатиме ваш внутрішній голос.Якщо вас не пов'язують якісь зобов'язання, спробуйте з дружньою увагою поспостерігати за собою: що ви робите, коли нічого не робите?Про що думаєте?Навіщо вас тягне?Не змушуйте себе сидіти на місці, слідуйте своїм внутрішнім спонуканням.І тоді ви з подивом виявите, що день, який обіцяв бути таким порожнім, виявився наповнений цікавими подіями та переживаннями.Якщо у цей день ви бачили сни, зверніть на них особливу увагу: вони можуть повідомляти про щось важливе.",
    'data/cards/03.gif': "Вітайте день, що почався: він обіцяє стати досить захоплюючим.Можливо, вас поманить до себе Природа, щоб підживити вашу душу і дух.Але й у звичайному житті на вас чекає свіжий вітер нових ідей та творчих імпульсів.Те, що ви носили в собі, можливо, дуже довго, сьогодні може нарешті знайти вихід, а те, на що ви давно махнули рукою, раптом оживе і почне бурхливо розвиватися.За що б ви не взялися сьогодні, все зрештою увінчається успіхом, тому що вами керуватиме безпомилковий інстинкт вибору правильного спрямування.",
    'data/cards/04.gif': "Сьогодні треба взятися за справу ґрунтовно.Яка б справа не мала вас сьогодні, хоч би як довго ви її відкладали, — час!Сьогодні ви сповнені енергії та сил, доля до вас прихильна, і робота прямо-таки горить у вас в руках: ви впораєтеся з будь-якою справою, з'ясуйте будь-які стосунки та виправите будь-які помилки та недоробки.Якщо у вас зараз немає такої конкретної справи, то, можливо, настав час хоча б навести лад у квартирі, полагодити велосипед чи сплатити рахунки, що залежалися?",
    'data/cards/05.gif': "Почніть день із відкриття Богу та Космосу, довіртеся їм.Ви вже багато досягли, і тепер у вас є можливість пізнати або почати робити щось, що дійсно має сенс.Тому не тримайтеся за старі правила та ритуали, і не слухайте пустословів, вони ж проповідники та політики.Шукайте внутрішній сенс будь-якої справи, його найприхованіше, найцінніше ядро, яке не видно з першого погляду, і не звертайте уваги на думку «зовнішніх».Якщо вас залучать до конфлікту, постарайтеся зайняти таку позицію, щоб через роки ви могли згадувати про неї зі спокійною совістю.",
    'data/cards/06.gif': "Прислухайтеся до свого серця — і ухваліть сьогодні рішення щодо певної людини, справи чи плану.Якщо ви досі зволікали з цим або сумнівалися, то займіть свій розум планами на найближчий вікенд, і дайте волю внутрішньому голосу та серцю.Знайдіть протиріччя чи протилежності, які вимагають примирення, полагодите зламане, відновіть зруйноване.Карта «Закоханих» не обов'язково означає велике кохання, яке чекає на найближчу автобусну зупинку.Хоча іноді трапляється таке.",
    'data/cards/07.gif': "Хороший день для початку будь-яких справ.Чого ще чекати?Мета у вас є, залишилося тільки перевірити, чи «усі у вас із собою», щоб пройти потрібний шлях — мало, раптом чогось не вистачить.Якщо ви не планували на сьогодні жодних нових справ і починань, значить, цей день може стати для вас сигналом, закликом до нової справи.Яка це буде справа, сказати важко, але принаймні для вас вона може стати початком нового етапу життя.",
    'data/cards/08.gif': "День максимальної продуктивності.Ви сповнені сил і енергії, ваша душа вимагає дії, тому не дивуйтеся, якщо хтось чи щось пристрасно захопить вас.Це не означає, що вам неодмінно потрібно влаштувати оргію, просто дайте своїм відчуттям повну свободу.Можете використати цей день і для того, щоб зробити значну частину якоїсь великої роботи.Покажіть свою зацікавленість, а якщо треба, то й пазурі.Сьогодні у вас вистачить сил, щоб подолати будь-які перешкоди і заручитися підтримкою та допомогою інших.",
    'data/cards/09.gif': "Цей день належить вам і лише вам.Займіться нарешті собою, абстрагувавшись від суєти зовнішнього світу.Якщо ж у цей день ви повинні виконати якусь справу, то займіться ним глибоко та докладно, не поспішаючи та не відволікаючись.Якщо вам потрібно прийняти якесь важливе рішення, то дайте йому дозріти добре, поки воно не стане для вас очевидним і природним.Можливо, знайти себе допоможе медитація, тривала прогулянка або просто споглядання водойми.",
    'data/cards/10.gif': "Бувають дні, коли ми маємо підкоритися неминучому.Якщо ви відчуваєте, що події насуваються невблаганно, то дайте їм статися.Пам'ятайте, що кожна подія має свій сенс, навіть якщо від нас вона ще прихована.Так що цілком можливо, що і для вас зрештою все обернеться на краще.",
    'data/cards/11.gif': "Сьогодні від вас потрібна ясність думки.Якщо ви переживаєте конфлікт, або вам потрібно ухвалити важливе рішення, насамперед намагайтеся зберегти порядність і врахувати віддалені наслідки своїх дій.Можливо також, що сьогодні вам доведеться зіткнутися з наслідками дій, вчинених раніше.Залежно від того, як ви повелися тоді, вам стане легко або, навпаки, моторошно на душі.",
    'data/cards/12.gif': "Сьогоднішній день викладе вам урок терпіння.Або щось, що й так тягнеться надто довго, затягнеться ще більше, або ж настане затримка в якійсь справі, від якої ви цього не очікували.Не намагайтеся прискорити перебіг подій, особливо силою: буде лише гірше.Можливо, достатньо переглянути своє ставлення до того, що відбувається, поглянути на все в новому світлі.Якщо це не допоможе, то вам доведеться принести якусь жертву, щоб справа зрушила з мертвої точки.",
    'data/cards/13.gif': "Сьогодні вам щось закінчиться.Щось нарешті пройде чи піде.Можливо, ви будете раді, що це нарешті завершилося, а можливо, вам буде шкода розлучатися з чимось, що колись означало для вас так багато.Принаймні будьте готові попрощатися з минулим.Не намагайтеся зберегти або реанімувати його.Відпустіть його від себе, і тоді зрештою ви відчуєте звільнення і полегшення, навіть якщо спочатку вам буде важко примиритися з цим.",
    'data/cards/14.gif': "Сьогодні - чарівний день, коли з вашої легкої руки можуть статися дивовижні відкриття, знахідки, чудеса творчості.Можливо, вам вдасться звести потрібних людей, вирішити складну проблему або скласти якусь хитру рецептуру.Але навіть якщо ви збиралися освідчитися в коханні, згладити гострі кути або помиритися, то і для цих цілей не знайти кращого дня, ніж сьогоднішній.",
    'data/cards/15.gif': "Хоча чорт і не такий страшний, як його малюють, проте сьогодні вам, мабуть, доведеться зустрітися з тіньовим боком свого характеру.Можливо, вас схилятимуть до якогось непристойного вчинку або до зради своїх принципів.Це може бути і якесь раптове внутрішнє спонукання, якого ви за собою не підозрювали (або думали, що давно подолали його) — заздрість, ревнощі, жадібність чи жадоба до влади.Не варто ні злитися на себе за це, ні звалювати провину на інших, як не варто і намагатися придушити це спонукання.Використовуйте ситуацію, щоб внести промінь світла у темну частину своєї душі: усвідомте це своє спонукання та з'ясуйте його причини.",
    'data/cards/16.gif': "Нудно вам сьогодні принаймні не буде.На вас чекає сюрприз, який може обернутися дивовижним відкриттям, але може стати і суттєвою перешкодою, ошуканими очікуваннями.Якщо раптова аварія планів засмутить вас або розсердить, що цілком зрозуміло, то не забувайте, що карта Башти в кінцевому підсумку означає злам рамок, що стали занадто тісними, або звільнення від уявлень, що зжили себе.Через якийсь час ви перестанете шкодувати, що не здійснилося сьогодні.",
    'data/cards/17.gif': "Радуйтеся сьогоднішньому дню: зірки до вас прихильні!Згадайте, про що ви мріяли?Хоч би що це було, беріться за справу сьогодні, і вона зрештою увінчається успіхом, тому що сьогодні інстинкт безпомилково вкаже вам вірний шлях.Якщо у вас немає жодних планів, спробуйте глянути на свою сьогоднішню ситуацію, так би мовити, з висоти пташиного польоту.Ви будете вражені, побачивши скільки цікавого вас оточує, і які нові горизонти відкриваються перед вами.",
    'data/cards/18.gif': "Можливо, вам наснився поганий сон, або цей день з якихось інших причин не видається вам добрим.Нехай ці примари вас не лякають.Навіть якщо ваш настрій зіпсувався від того, що вам сьогодні належить важка чи неприємна справа, розмова чи зустріч, не намагайтеся уникнути їх.Пам'ятайте, що за цим порогом страху на вас чекає щось нове і важливе, тому вам треба зібратися з духом і переступити поріг.Прийміть цей день таким, який він є, і йдіть вперед обережно, але впевнено, незважаючи на всі страхи.І ви з подивом виявите, наскільки багато чого досягли.",
    'data/cards/19.gif': "Цей день буде для вас сонячним і ви зможете насолодитися ним повною мірою.Можливо, він просто пройде без турбот, а можливо, на вас чекає якась блискуча перемога.З тією радістю життя і вірою в себе, які вас переповнюють, ви сьогодні можете взятися і за будь-яку нову справу, знаходячи та захоплюючи однодумців.Якщо ви посварилися з кимось або знаєте, що на вас ображаються, то сьогодні — найкращий день для великодушного прощення та примирення ворогуючих сторін.",
    'data/cards/20.gif': "Сьогодні ви можете вирішити свою проблему — хоч щойно виниклу, хоч застарілу.Просто тримайте очі відкритими, щоб не проґавити цю можливість.Можливо, вам і не треба нічого робити, — тільки чекати.Хоча іноді, щоб знайти остаточне рішення, буває потрібний невеликий внутрішній поштовх.",
    'data/cards/21.gif': "Сьогодні ви відчуваєте незвичайний приплив сил та свою гармонію з навколишнім світом.Або всі справи йдуть так, як ви і задумали, або ви просто не надаєте значення можливим перешкод.Насолоджуйтесь цим днем, цим райським спокоєм, і радуйте свою душу.Якщо ви зараз шукаєте притулок — хоч у фізичному, хоч у психологічному чи духовному сенсі, — то сьогодні ви можете зробити важливий крок у цьому напрямку",
    # Ваши gif-файлы и описания
}

# Функция для отправки случайного gif и описания
async def send_daily_forecast(user_id):
    gif_files = list(gif_data.keys())

    if not gif_files:
        await bot.send_message(user_id, "Вибачте, немає доступних gif-зображень зараз.")
        return

    gif_path = random.choice(gif_files)
    description = gif_data[gif_path]
    gif_file = FSInputFile(gif_path)
    await bot.send_document(user_id, gif_file, caption=description)

    user_last_daily_forecast[user_id] = datetime.datetime.now()

    keyboard = ReplyKeyboardMarkup(resize_keyboard=True, one_time_keyboard=True, keyboard=[
        [KeyboardButton(text="Прогноз на день 🙏")],
        [KeyboardButton(text="⭐ Мої послуги")],
        [KeyboardButton(text="Мій рахунок 💰")],
        [KeyboardButton(text="❓❓❓ Задати питання")],
        [KeyboardButton(text="Зв'язатися зі мною 📞")]
    ])

    await bot.send_message(user_id, "Виберіть пункт меню👇:", reply_markup=keyboard)

# Обработчик команды /start
@router.message(Command("start"))
async def process_start_command(message: types.Message):
    user_id = message.from_user.id
    user_ids = load_user_ids()
    if user_id not in user_ids:
        user_ids.append(user_id)
        save_user_ids(user_ids)
    
    keyboard = ReplyKeyboardMarkup(resize_keyboard=True, one_time_keyboard=True, keyboard=[
        [KeyboardButton(text="Прогноз на день 🙏")],
        [KeyboardButton(text="⭐ Мої послуги")],
        [KeyboardButton(text="Мій рахунок 💰")],
        [KeyboardButton(text="❓❓❓ Задати питання")],
        [KeyboardButton(text="Зв'язатися зі мною 📞")]
    ])
    await message.answer("Виберіть пункт меню👇:", reply_markup=keyboard)

# Словарь для хранения состояния пользователей
user_states = {}

# Обработчик текстовых сообщений
@router.message(lambda message: message.text in ["Прогноз на день 🙏", "⭐ Мої послуги", "Мій рахунок 💰", "❓❓❓ Задати питання", "Зв'язатися зі мною 📞"])
async def process_text_message(message: types.Message):
    user_id = message.from_user.id
    action = message.text

    keyboard = ReplyKeyboardMarkup(resize_keyboard=True, one_time_keyboard=True, keyboard=[
        [KeyboardButton(text="Прогноз на день 🙏")],
        [KeyboardButton(text="⭐ Мої послуги")],
        [KeyboardButton(text="Мій рахунок 💰")],
        [KeyboardButton(text="❓❓❓ Задати питання")],
        [KeyboardButton(text="Зв'язатися зі мною 📞")]
    ])

    if action == "Прогноз на день 🙏":
        last_used = user_last_daily_forecast.get(user_id)
        if last_used and (datetime.datetime.now() - last_used).total_seconds() < 86400:
            await message.answer("Ви вже одержали прогноз на сьогодні!\nНапишіть своє запитання або запишіться на прийом👇", reply_markup=keyboard)
        else:
            await send_daily_forecast(user_id)
    elif action == "⭐ Мої послуги":
        await message.answer("Індивідуальні розклади Таро по всім життєвим ситуаціям:\n🧑‍💼Робота\n💵Фінанси\n💌Кохання\n⚕️Здоров’я", reply_markup=keyboard)
    elif action == "Мій рахунок 💰":
        await message.answer("ПриватБанк: \n4149609029416874 ", reply_markup=keyboard)
    elif action == "❓❓❓ Задати питання":
        user_states[user_id] = "awaiting_question"
        await message.answer("Будь ласка, введіть ваше запитання❓", reply_markup=keyboard)
    elif action == "Зв'язатися зі мною 📞":
        await message.answer("Зв'язатися зі мною можна за номером:\n +380991053527", reply_markup=keyboard)

# Обработчик сообщений пользователей
@router.message(lambda message: user_states.get(message.from_user.id) == "awaiting_question")
async def handle_question(message: types.Message):
    user_id = message.from_user.id
    user_name = message.from_user.full_name
    user_question = message.text

    await bot.send_message(ADMIN_ID, f"Питання від користувача {user_name} (ID: {user_id}):\n{user_question}")

    user_states[user_id] = None

    keyboard = ReplyKeyboardMarkup(resize_keyboard=True, one_time_keyboard=True, keyboard=[
        [KeyboardButton(text="Прогноз на день 🙏")],
        [KeyboardButton(text="⭐ Мої послуги")],
        [KeyboardButton(text="Мій рахунок 💰")],
        [KeyboardButton(text="❓❓❓ Задати питання")],
        [KeyboardButton(text="Зв'язатися зі мною 📞")]
    ])

    inline_keyboard = InlineKeyboardMarkup(inline_keyboard=[
        [InlineKeyboardButton(text="Відповісти користувачеві", callback_data=f"answer:{user_id}")]
    ])

    await message.answer("Ваше запитання надіслано адміністратору. Чекайте на відповідь⏲️", reply_markup=keyboard)
    await bot.send_message(ADMIN_ID, "Натисніть нижче, щоб відповісти на запитання користувача👇", reply_markup=inline_keyboard)

# Обработчик callback-запросов для ответа на вопрос пользователя
@router.callback_query(lambda c: c.data and c.data.startswith('answer:'))
async def process_callback_answer(callback_query: types.CallbackQuery):
    user_id = callback_query.data.split(':')[1]
    user_id = int(user_id)

    await bot.send_message(callback_query.from_user.id, f"Введіть відповідь для користувача з ID: {user_id}")

    user_states[callback_query.from_user.id] = f"answering:{user_id}"

# Обработчик текстовых сообщений от администратора для отправки ответа пользователю
@router.message(lambda message: user_states.get(message.from_user.id, "").startswith("answering:"))
async def handle_admin_answer(message: types.Message):
    admin_id = message.from_user.id
    state = user_states.get(admin_id, "")
    if state:
        user_id = int(state.split(':')[1])
        answer_text = message.text

        await bot.send_message(user_id, f"Відповідь від 😀 адміністратора: {answer_text}")
        await message.answer("Відповідь надіслано користувачу🙏")
        user_states[admin_id] = None

# Функция для отправки сообщения всем пользователям
async def broadcast_message(text=None, photo=None, video=None):
    user_ids = load_user_ids()
    for user_id in user_ids:
        try:
            if text:
                await bot.send_message(chat_id=user_id, text=text)
            elif photo:
                await bot.send_photo(chat_id=user_id, photo=photo)
            elif video:
                await bot.send_video(chat_id=user_id, video=video)
        except Exception as e:
            logging.error(f"Failed to send message to {user_id}: {e}")

# Команда для отправки сообщения всем пользователям
@router.message(Command("broadcast"))
async def handle_broadcast_command(message: types.Message):
    if message.from_user.id == ADMIN_ID:
        user_states[message.from_user.id] = "awaiting_broadcast"
        await message.answer("Будь ласка, введіть повідомлення для розсилки.")
    else:
        await message.answer("У вас немає прав для використання цієї команди.")

# Обработчик сообщений администратора для рассылки
@router.message(lambda message: user_states.get(message.from_user.id) == "awaiting_broadcast")
async def handle_broadcast_message(message: types.Message):
    if message.from_user.id == ADMIN_ID:
        user_states[message.from_user.id] = None
        await broadcast_message(text=message.text)
        await message.answer("Повідомлення розіслано всім користувачам.")
    else:
        await message.answer("У вас немає прав для використання цієї команди.")

# Регистрация роутеров и запуск бота
async def main():
    dp.include_router(router)
    await dp.start_polling(bot)

if __name__ == '__main__':
    keep_alive()
    asyncio.run(main())
