[
    {
        "name": "Card 1",
        "file": "00.gif",
        "description": "Дурень",
        "advice": "Ідея, думка, духовність, те, що прагне піднестися над матеріальним (якщо предмет, який ворожать, пов'язані з духовним). У гаданні на матеріальний об'єкт, пов'язаний із повсякденним життям, карта вважається поганою, вона означає необачність, дурість, ексцентричність, манію і навіть психічну хворобу."
    },
    {
        "name": "Card 2",
        "file": "01.gif",
        "description": "Маг",
        "advice": "Вміння, мудрість, пристосованість, здатність, розум і хитрість, спритність і так далі завжди спираються на гідність. Іноді окультна мудрість."
    },
    {
        "name": "Card 3",
        "file": "02.gif",
        "description": "Верховна жриця",
        "advice": "Мудрість, знання, зміна, зміна, збільшення та зменшення. Коливання"
    },
    {
        "name": "Card 4",
        "file": "03.gif",
        "description": "Імператриця",
        "advice": "Краса, щастя, задоволення, успіх, розкіш. У дуже поганій гідності карта означає розсіяння, безпутний спосіб життя."
    },
    {
        "name": "Card 5",
        "file": "04.gif",
        "description": "Імператор",
        "advice": "Війна, завоювання та підкорення, перемога, сварка, честолюбство, втілення, розвиток, досягнення."
    },
    {
        "name": "Card 6",
        "file": "05.gif",
        "description": "Верховний жрець",
        "advice": "Божественна мудрість, милосердя, вияв, пояснення, вчення. У деяких аспектах збігається за значенням з картами Маг, Путівник і Закохані. Окультна мудрість."
    },
    {
        "name": "Card 7",
        "file": "06.gif",
        "description": "Закохані",
        "advice": "Натхнення. Мотив, дія та влада, що виникають з натхнення та пориву."
    },
    {
        "name": "Card 8",
        "file": "07.gif",
        "description": "Колісниця",
        "advice": "Тріумф, перемога, подолання перешкод, здоров'я. Успіх, щоправда часом швидкоплинний і нестабільний."
    },
    {
        "name": "Card 9",
        "file": "08.gif",
        "description": "Сила",
        "advice": "Сміливість, мужність, могутність, сила духу та стійкість. Сила непереборна, подібна до суду, що завершує справу. Іноді символізує тупу завзятість та перевищення влади."
    },
    {
        "name": "Card 10",
        "file": "09.gif",
        "description": "Путівник",
        "advice": "Мудрість згори, яку шукають і обрядять. Розсудливість і далекоглядність, передбачливість та роздуми. Божественне натхнення."
    },
    {
        "name": "Card 11",
        "file": "10.gif",
        "description": "Колесо фортуни",
        "advice": "Добрий успіх і щастя, але в певних межах. У поганій гідності: сп'яніння успіхом чи невдача, а також провал, якщо інші карти, що лежать поруч, це підтверджують."
    },
    {
        "name": "Card 12",
        "file": "11.gif",
        "description": "Справедливість",
        "advice": "Вічна правосуддя та рівновага, баланс. Сила і міць, але стримані, так само як і в процесі суду. Також у комбінаціях з іншими картами юридичні процедури, слухання справи в суді, суд, випробування судом тощо. У поганій гідності: жорстокість та упередження."
    },
    {
        "name": "Card 13",
        "file": "12.gif",
        "description": "Повішений",
        "advice": "Покарання. Втрата. Страждання взагалі. Жертва не завжди добровільна."
    },
    {
        "name": "Card 14",
        "file": "13.gif",
        "description": "Смерть",
        "advice": "Часи. Століття. Перетворення. Зміна. Ненавмисне зміна, на противагу Місяцю. Іноді смерть і руйнація, останнє, щоправда, дуже рідко."
    },
    {
        "name": "Card 15",
        "file": "14.gif",
        "description": "Помірність",
        "advice": "Поєднання, комбінація сил. Реалізація. Об'єднання. Матеріальна дія, результат якої може бути як хорошим, так і поганим."
    },
    {
        "name": "Card 16",
        "file": "15.gif",
        "description": "Диявол",
        "advice": "Матеріальність. Матеріальна сила. Спокуса матеріальна або іноді нав'язлива ідея, особливо якщо карта пов'язана з закоханими."
    },
    {
        "name": "Card 17",
        "file": "16.gif",
        "description": "Вежа",
        "advice": "Амбіція, боротьба, сварка, війна, хоробрість. Порівняйте з Імператором. У поганій гідності у деяких поєднаннях: руйнація, аварія, падіння, небезпека."
    },
    {
        "name": "Card 18",
        "file": "17.gif",
        "description": "Зірка",
        "advice": "Надія, віра, несподівана допомога. У поганій гідності: мрійливість, ошукана надія."
    },
    {
        "name": "Card 19",
        "file": "18.gif",
        "description": "Місяць",
        "advice": "Незадоволеність, добровільна зміна (на противагу карті Смерть). У поганій гідності помилка, брехня, фальш, обман."
    },
    {
        "name": "Card 20",
        "file": "19.gif",
        "description": "Сонце",
        "advice": "Слава, вигода та придбання, багатство, щастя, радість. У поганій гідності: марнославство, зарозумілість, чванлива показуха."
    },
    {
        "name": "Card 21",
        "file": "20.gif",
        "description": "Страшний суд",
        "advice": "Остаточне рішення, судження, вирок, результат, визначення будь-якої справи чи питання без надії на апеляцію чи перегляд. У поганому гідності: відкладання справи."
    },
    {
        "name": "Card 22",
        "file": "21.gif",
        "description": "Мир",
        "advice": "Матерія, сутність, синтез, завершення, винагорода. Світ, царство. Зазвичай означає суть питання і тому цілком залежить від навколишніх карток."
    }


]
